return {
    -- 🔧 إعدادات الماب
    MAP_SETTINGS = {
        ALLOWED_MAP_IDS = {
            1234567890,  -- ضع هنا ID الماب الأول
            9876543210,  -- ضع هنا ID الماب الثاني
            5555555555,  -- ضع هنا ID الماب الثالث
            -- زيد IDs المابس الي تبيها
        },
        
        -- أو إذا تبي ماب واحد فقط:
        TARGET_MAP_ID = 1234567890,  -- غير هذا الرقم لـ ID الماب المطلوب
    },
    
    -- 🚫 قائمة اللاعبين المحظورين
    BLACKLISTED_PLAYERS = {
        "H7MOD_12",
        "KWT_20082",
        "nanMrYesHack",
        "AImsaudIlIlII",
        "7ob_i",
        "Fc7v7",
        "madness_tea",
        "7aliv9",
        "Si07Ac",
        "nanMoscoww",
        "thamer02500",
        "smartboy23089",
        "MOMOLL996",
        "Kisarabc",
        "nanMrNoHackk",
        "nanyabusinesss",
        "Faah12312",
        "AWR_935115",
        "ZBZBGX212",
        "wjehfkjuihuif",
        "Fahdmint",
        "KB_44144",
        "klrm_471",
        "AImsaudIlIlII",
        "e9p",
        "rjycjjou",
        "67_nt",
    },
    
    -- ⚠️ قائمة الـ IDs المحظورة (لمضاد الغش)
    BLOCKED_IDS = {
        "importuidpluginlogo",
        "5034718129",
        "5642310344",
        "5642383285",
        "5034718180",
        "5054663650",
        "5034768003",
        "1427967925",
        "6234266378",
        "6401617475",
        "6425281788",
        "1072518406",
        "1072518502",
        "2764171053",
        "6578871732",
        "6578933307",
        "6579106223",
        "6065821980",
        "6065821086",
        "6065821596",
        "6065775281",
        "8776783827",
        "6764432293",
        "1281023007",
    }
}
